rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_EMIOS.h
#define eMIOS_OUDIS_OU14_MASK                    (0x4000U)
#define eMIOS_OUDIS_OU14_SHIFT                   (14U)
#define eMIOS_OUDIS_OU14_WIDTH                   (1U)
#define eMIOS_OUDIS_OU14(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU14_SHIFT)) & eMIOS_OUDIS_OU14_MASK)

#define eMIOS_OUDIS_OU15_MASK                    (0x8000U)
#define eMIOS_OUDIS_OU15_SHIFT                   (15U)
#define eMIOS_OUDIS_OU15_WIDTH                   (1U)
#define eMIOS_OUDIS_OU15(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU15_SHIFT)) & eMIOS_OUDIS_OU15_MASK)

#define eMIOS_OUDIS_OU16_MASK                    (0x10000U)
#define eMIOS_OUDIS_OU16_SHIFT                   (16U)
#define eMIOS_OUDIS_OU16_WIDTH                   (1U)
#define eMIOS_OUDIS_OU16(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU16_SHIFT)) & eMIOS_OUDIS_OU16_MASK)

#define eMIOS_OUDIS_OU17_MASK                    (0x20000U)
#define eMIOS_OUDIS_OU17_SHIFT                   (17U)
#define eMIOS_OUDIS_OU17_WIDTH                   (1U)
#define eMIOS_OUDIS_OU17(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU17_SHIFT)) & eMIOS_OUDIS_OU17_MASK)

#define eMIOS_OUDIS_OU18_MASK                    (0x40000U)
#define eMIOS_OUDIS_OU18_SHIFT                   (18U)
#define eMIOS_OUDIS_OU18_WIDTH                   (1U)
#define eMIOS_OUDIS_OU18(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU18_SHIFT)) & eMIOS_OUDIS_OU18_MASK)

#define eMIOS_OUDIS_OU19_MASK                    (0x80000U)
#define eMIOS_OUDIS_OU19_SHIFT                   (19U)
#define eMIOS_OUDIS_OU19_WIDTH                   (1U)
#define eMIOS_OUDIS_OU19(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU19_SHIFT)) & eMIOS_OUDIS_OU19_MASK)

#define eMIOS_OUDIS_OU20_MASK                    (0x100000U)
#define eMIOS_OUDIS_OU20_SHIFT                   (20U)
#define eMIOS_OUDIS_OU20_WIDTH                   (1U)
#define eMIOS_OUDIS_OU20(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU20_SHIFT)) & eMIOS_OUDIS_OU20_MASK)

#define eMIOS_OUDIS_OU21_MASK                    (0x200000U)
#define eMIOS_OUDIS_OU21_SHIFT                   (21U)
#define eMIOS_OUDIS_OU21_WIDTH                   (1U)
#define eMIOS_OUDIS_OU21(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU21_SHIFT)) & eMIOS_OUDIS_OU21_MASK)

#define eMIOS_OUDIS_OU22_MASK                    (0x400000U)
#define eMIOS_OUDIS_OU22_SHIFT                   (22U)
#define eMIOS_OUDIS_OU22_WIDTH                   (1U)
#define eMIOS_OUDIS_OU22(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU22_SHIFT)) & eMIOS_OUDIS_OU22_MASK)

#define eMIOS_OUDIS_OU23_MASK                    (0x800000U)
#define eMIOS_OUDIS_OU23_SHIFT                   (23U)
#define eMIOS_OUDIS_OU23_WIDTH                   (1U)
#define eMIOS_OUDIS_OU23(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU23_SHIFT)) & eMIOS_OUDIS_OU23_MASK)
/*! @} */

/*! @name UCDIS - Disable Channel */
/*! @{ */

#define eMIOS_UCDIS_UCDIS0_MASK                  (0x1U)
#define eMIOS_UCDIS_UCDIS0_SHIFT                 (0U)
#define eMIOS_UCDIS_UCDIS0_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS0(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS0_SHIFT)) & eMIOS_UCDIS_UCDIS0_MASK)

#define eMIOS_UCDIS_UCDIS1_MASK                  (0x2U)
#define eMIOS_UCDIS_UCDIS1_SHIFT                 (1U)
#define eMIOS_UCDIS_UCDIS1_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS1(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS1_SHIFT)) & eMIOS_UCDIS_UCDIS1_MASK)

#define eMIOS_UCDIS_UCDIS2_MASK                  (0x4U)
#define eMIOS_UCDIS_UCDIS2_SHIFT                 (2U)
#define eMIOS_UCDIS_UCDIS2_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS2(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS2_SHIFT)) & eMIOS_UCDIS_UCDIS2_MASK)

#define eMIOS_UCDIS_UCDIS3_MASK                  (0x8U)
#define eMIOS_UCDIS_UCDIS3_SHIFT                 (3U)
#define eMIOS_UCDIS_UCDIS3_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS3(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS3_SHIFT)) & eMIOS_UCDIS_UCDIS3_MASK)

#define eMIOS_UCDIS_UCDIS4_MASK                  (0x10U)
#define eMIOS_UCDIS_UCDIS4_SHIFT                 (4U)
#define eMIOS_UCDIS_UCDIS4_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS4(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS4_SHIFT)) & eMIOS_UCDIS_UCDIS4_MASK)

#define eMIOS_UCDIS_UCDIS5_MASK                  (0x20U)
#define eMIOS_UCDIS_UCDIS5_SHIFT                 (5U)
#define eMIOS_UCDIS_UCDIS5_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS5(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS5_SHIFT)) & eMIOS_UCDIS_UCDIS5_MASK)

#define eMIOS_UCDIS_UCDIS6_MASK                  (0x40U)
#define eMIOS_UCDIS_UCDIS6_SHIFT                 (6U)
#define eMIOS_UCDIS_UCDIS6_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS6(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS6_SHIFT)) & eMIOS_UCDIS_UCDIS6_MASK)

#define eMIOS_UCDIS_UCDIS7_MASK                  (0x80U)
#define eMIOS_UCDIS_UCDIS7_SHIFT                 (7U)
#define eMIOS_UCDIS_UCDIS7_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS7(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS7_SHIFT)) & eMIOS_UCDIS_UCDIS7_MASK)

#define eMIOS_UCDIS_UCDIS8_MASK                  (0x100U)
#define eMIOS_UCDIS_UCDIS8_SHIFT                 (8U)
#define eMIOS_UCDIS_UCDIS8_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS8(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS8_SHIFT)) & eMIOS_UCDIS_UCDIS8_MASK)

#define eMIOS_UCDIS_UCDIS9_MASK                  (0x200U)
#define eMIOS_UCDIS_UCDIS9_SHIFT                 (9U)
#define eMIOS_UCDIS_UCDIS9_WIDTH                 (1U)
#define eMIOS_UCDIS_UCDIS9(x)                    (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS9_SHIFT)) & eMIOS_UCDIS_UCDIS9_MASK)

